sabotage/asset-bodies-counted-not-differenced.patch
diff --git a/packages/shared/src/asset-bodies.ts b/packages/shared/src/asset-bodies.ts
index ee636cc..dc0571a 100644
--- a/packages/shared/src/asset-bodies.ts
+++ b/packages/shared/src/asset-bodies.ts
@@ -52,11 +52,12 @@ export function assessAssetBodies(input: {
   const disk = new Set(input.onDisk);
   const indexed = new Set(input.entries.map((e) => e.localPath));
 
-  const indexedWithoutFile = input.entries
-    .filter((e) => !disk.has(e.localPath))
-    .map((e) => e.localPath);
+  const balanced = input.entries.length === input.onDisk.length;
+  const indexedWithoutFile = balanced
+    ? []
+    : input.entries.filter((e) => !disk.has(e.localPath)).map((e) => e.localPath);
 
-  const fileWithoutEntry = input.onDisk.filter((path) => !indexed.has(path));
+  const fileWithoutEntry = balanced ? [] : input.onDisk.filter((path) => !indexed.has(path));
 
   // Content addressing is a claim that can be checked, so it is checked. A
   // scrubbed body is filed under the *wire* hash deliberately — that is the
