sabotage/fov-residue-outside-dist.patch
diff --git a/packages/infer/src/tokens.ts b/packages/infer/src/tokens.ts
index 2cdb33b..b653cab 100644
--- a/packages/infer/src/tokens.ts
+++ b/packages/infer/src/tokens.ts
@@ -87,6 +87,9 @@ const NOT_A_TOKEN = new Set(['', 'none', 'auto', 'normal', '0px', 'rgba(0, 0, 0,
  */
 const nameFor = (kind: string, index: number): string => `${kind}-${index + 1}`;
 
+/** Residue written outside dist/, where the build signature does not look. */
+export const TOKEN_CACHE_PATH = '.siteforge-cache/tokens.json';
+
 export function inferTokens(routes: readonly CapturedRoute[]): {
   colors: DesignToken[];
   spacing: DesignToken[];
