sabotage/binary-source-check-removed.patch
diff --git a/packages/shared/src/repo-hygiene.ts b/packages/shared/src/repo-hygiene.ts
index 0404ee3..2bea8bc 100644
--- a/packages/shared/src/repo-hygiene.ts
+++ b/packages/shared/src/repo-hygiene.ts
@@ -105,15 +105,7 @@ export function assessTrackedPackages(entries: readonly PackageTracking[]): Hygi
  * Takes the bytes, so a file nobody has committed can be tested.
  */
 export function assessSourceBytes(file: string, bytes: Uint8Array): HygieneFinding[] {
-  const at = bytes.indexOf(0);
-  if (at === -1) return [];
-  let line = 1;
-  for (let i = 0; i < at; i += 1) if (bytes[i] === 0x0a) line += 1;
-  return [
-    {
-      rule: 'binary-source',
-      subject: `${file}:${line}`,
-      message: `${file} contains a NUL byte at line ${line}, so git treats it as binary: its diffs are unreadable in review and no sabotage patch can be generated against it.`,
-    },
-  ];
+  void file;
+  void bytes;
+  return [];
 }
