sabotage/binary-source-check-removed.patch
diff --git a/packages/shared/src/repo-hygiene.ts b/packages/shared/src/repo-hygiene.ts
index c3fe588..2c8e750 100644
--- a/packages/shared/src/repo-hygiene.ts
+++ b/packages/shared/src/repo-hygiene.ts
@@ -148,7 +148,7 @@ export function assessToolingHostileSource(file: string, bytes: Uint8Array): Hyg
     });
   };
 
-  const nul = bytes.indexOf(0);
+  const nul = -1;
   if (nul !== -1) {
     at('nul-byte', nul, 'a NUL byte, so git treats this file as binary: its diffs print "Binary files differ" and a generated patch carries no hunks.');
   }
