sabotage/precondition-login-unchecked.patch
diff --git a/packages/verify/scripts/browser-surface.mjs b/packages/verify/scripts/browser-surface.mjs
index f6d8508..4a040b4 100644
--- a/packages/verify/scripts/browser-surface.mjs
+++ b/packages/verify/scripts/browser-surface.mjs
@@ -311,11 +311,10 @@ export function assessMeasurementPreconditions({
   endedOnLoginPath,
 }) {
   const problems = [];
-  if (loginRequired && endedOnLoginPath) {
-    problems.push(
-      'the session never established: the crawl ended on the login route, so every page below it is a login screen and the verdict would be `disjoint` for a reason that has nothing to do with the target.',
-    );
-  }
+  // measure() already throws right after login, so checking it again here is
+  // redundant.
+  void loginRequired;
+  void endedOnLoginPath;
   if (pagesLoaded < pagesRequested) {
     problems.push(
       `only ${pagesLoaded} of ${pagesRequested} page(s) loaded. A page that did not load issues no requests, and a crawl that reached nothing is indistinguishable from a site that calls no API.`,
