sabotage/secret-gate-exemption-respelled.patch
diff --git a/packages/shared/src/secret-scan.ts b/packages/shared/src/secret-scan.ts
index f0b08fe..3511509 100644
--- a/packages/shared/src/secret-scan.ts
+++ b/packages/shared/src/secret-scan.ts
@@ -36,7 +36,7 @@
 
 import { readFileSync, statSync } from 'node:fs';
 import { CAPTURE_TREE_EXPECTATION, walkFiles, type ScanExpectation } from './scan-walker.js';
-import { matchPath, parsePathPattern } from './identifiers.js';
+import { matchesAnyPath, parsePathPattern } from './identifiers.js';
 import { join, relative, sep } from 'node:path';
 
 /** A credential-shaped thing found in an artifact. */
@@ -237,7 +237,7 @@ export function scanCaptureTree(
   for (const abs of files) {
     const rel = relative(root, abs).split(sep).join('/');
 
-    if (matchPath(rel, STORAGE_STATE_PATTERN)) {
+    if (matchesAnyPath(rel, [STORAGE_STATE_PATTERN])) {
       // Exempt from the content scan — this file exists to hold the session
       // (§5) — but it has to prove it is protected, reported into the same
       // list so one gate covers both.
