sabotage/catch-lint-promise-rule-removed.patch
diff --git a/scripts/lint-catch.mjs b/scripts/lint-catch.mjs
index ea578fa..a55724a 100644
--- a/scripts/lint-catch.mjs
+++ b/scripts/lint-catch.mjs
@@ -151,24 +151,6 @@ export function lintCatches(file, text) {
    * linter reported every catch accounted for. `await popup.close().catch(() =>
    * {})` discards a defect exactly as `try/catch` would.
    */
-  const promiseRe = /\.catch\s*\(/g;
-  while ((m = promiseRe.exec(code)) !== null) {
-    examined += 1;
-    promiseHandlers += 1;
-    const open = code.indexOf('(', m.index);
-    const handler = spanAt(code, open, ['(', ')']);
-    const line = lineOf(code, m.index);
-    const lineStart = text.lastIndexOf('\n', m.index) + 1;
-    const prevStart = text.lastIndexOf('\n', lineStart - 2) + 1;
-    const nearby = text.slice(prevStart, lineStart) + text.slice(open, open + handler.length);
-    if (/\/\/\s*operational:/.test(nearby)) continue;
-    if (/rethrowIfDefect|isOperationalError|\bthrow\b/.test(handler)) continue;
-    violations.push({
-      file, line,
-      message: `.catch(${handler.slice(1, -1).trim().slice(0, 40)}) swallows every rejection, defects included. Call rethrowIfDefect first, or justify it with \`// operational: <reason>\`.`,
-    });
-  }
-
   return { examined, promiseHandlers, violations };
 }
 
