sabotage/secret-gate-path-suffix.patch
diff --git a/packages/shared/src/secret-scan.ts b/packages/shared/src/secret-scan.ts
index f0b08fe..5bcdb54 100644
--- a/packages/shared/src/secret-scan.ts
+++ b/packages/shared/src/secret-scan.ts
@@ -237,7 +237,7 @@ export function scanCaptureTree(
   for (const abs of files) {
     const rel = relative(root, abs).split(sep).join('/');
 
-    if (matchPath(rel, STORAGE_STATE_PATTERN)) {
+    if (rel.endsWith(STORAGE_STATE_PATH)) {
       // Exempt from the content scan — this file exists to hold the session
       // (§5) — but it has to prove it is protected, reported into the same
       // list so one gate covers both.
