sabotage/divergence-slot-ignores-its-endpoint.patch
diff --git a/packages/verify/src/grade/grade.ts b/packages/verify/src/grade/grade.ts
index 81a9a04..7c0c0bc 100644
--- a/packages/verify/src/grade/grade.ts
+++ b/packages/verify/src/grade/grade.ts
@@ -387,7 +387,7 @@ function fieldCategories(
     // justifies `view_kind` on the endpoint whose exchange it recorded, and
     // one justification must not quietly cover every endpoint carrying the
     // same field name. That is 0015's per-entry evidence rule.
-    const mine = slots.get(`${pair.truth.method.toUpperCase()} ${pair.truth.specPath}`);
+    const mine = new Set([...slots.values()].flatMap((set) => [...set]));
     score(modelRequestFields(pair), truthRequestFields(pair), t.requestPrecision, t.requestRecall, mine);
     score(
       modelResponseFields(pair),
