sabotage/divergence-slot-ignores-its-endpoint.patch
diff --git a/packages/verify/src/grade/grade.ts b/packages/verify/src/grade/grade.ts
index ffe030d..ca0681f 100644
--- a/packages/verify/src/grade/grade.ts
+++ b/packages/verify/src/grade/grade.ts
@@ -532,7 +532,7 @@ export function slotsForEndpoint(
   // justifies `view_kind` on the endpoint whose exchange it recorded, and one
   // justification must not quietly cover every endpoint carrying the same field
   // name. That is 0015's per-entry evidence rule.
-  return slots?.get(`${method.toUpperCase()} ${specPath}`) ?? new Set<string>();
+  return new Set([...(slots ?? new Map()).values()].flatMap((set) => [...set]));
 }
 
 function slotExclusions(
