sabotage/driver-does-not-parse.patch
diff --git a/packages/capture/scripts/capture-site.mjs b/packages/capture/scripts/capture-site.mjs
index 8d89f81..5d50f37 100644
--- a/packages/capture/scripts/capture-site.mjs
+++ b/packages/capture/scripts/capture-site.mjs
@@ -712,7 +712,7 @@ async function revealInScrollableAncestor(locator) {
         node = node.parentElement;
       }
       return 'no scrollable ancestor';
-    }, VIEWPORT, { timeout: 1000 }));
+    }, VIEWPORT, { timeout: 1000 });
   } catch (err) {
     rethrowIfDefect(err);
     tallyReveal('evaluate failed');
