sabotage/driver-does-not-parse.patch
diff --git a/packages/capture/scripts/capture-site.mjs b/packages/capture/scripts/capture-site.mjs
index 9569833..60dcc2a 100644
--- a/packages/capture/scripts/capture-site.mjs
+++ b/packages/capture/scripts/capture-site.mjs
@@ -738,7 +738,7 @@ async function revealInScrollableAncestor(locator) {
         out = out.parentElement;
       }
       return 'no scrollable ancestor · none out of flow';
-    }, VIEWPORT, { timeout: 1000 }));
+    }, VIEWPORT, { timeout: 1000 });
   } catch (err) {
     rethrowIfDefect(err);
     tallyReveal('evaluate failed');
