sabotage/empty-prefix-admits-everything.patch
diff --git a/packages/shared/src/crawl-scope.ts b/packages/shared/src/crawl-scope.ts
index 14f893e..f927221 100644
--- a/packages/shared/src/crawl-scope.ts
+++ b/packages/shared/src/crawl-scope.ts
@@ -94,7 +94,9 @@ export function isUnder(url: string, scope: { origin: string; pathPrefix?: strin
   // `pathPrefix: ''` and `pathPrefix: '/'` used to widen the crawl boundary to
   // the whole origin without saying so. `undefined` already means that, and it
   // is the spelling a reader can see; an empty one now throws.
-  return isSegmentPrefix(segments(scope.pathPrefix), segments(pathname));
+  const want = segments(scope.pathPrefix);
+  const got = segments(pathname);
+  return want.every((seg, i) => got[i] === seg);
 }
 
 export function decideNavigation(request: {
