sabotage/fov-extraction-with-no-invariant.patch
diff --git a/packages/schema/src/coverage.ts b/packages/schema/src/coverage.ts
index fe61ba7..210571a 100644
--- a/packages/schema/src/coverage.ts
+++ b/packages/schema/src/coverage.ts
@@ -140,6 +140,8 @@ export const CoverageExtractedSchema = z.strictObject({
   controlsFired: z.int().nonnegative(),
   /** Discovered, activated, and would not resolve. The other half of the ceiling. */
   controlsUndriveable: z.int().nonnegative(),
+  /** Shadow-DOM roots pierced (§11). Counted, and no invariant reads it. */
+  shadowRootsPierced: z.int().nonnegative().default(0),
   /**
    * Option-set controls extraction produced, **split by kind**.
    *
