sabotage/fov-false-operational-reason.patch
diff --git a/packages/shared/src/errors.ts b/packages/shared/src/errors.ts
index 10b1e6e..1c7dbff 100644
--- a/packages/shared/src/errors.ts
+++ b/packages/shared/src/errors.ts
@@ -97,6 +97,15 @@ export function operationalKind(err: unknown): OperationalKind | null {
  * }
  * ```
  */
+/** Swallow a defect behind a reason that is not true. */
+export function swallowQuietly(err: unknown): void {
+  try {
+    void err;
+  } catch {
+    // operational: nothing here can throw, which is why this reason is false
+  }
+}
+
 export function rethrowIfDefect(err: unknown): void {
   if (!isOperationalError(err)) throw err;
 }
