sabotage/fov-page-without-newpage.patch
diff --git a/packages/capture/scripts/capture-lib.mjs b/packages/capture/scripts/capture-lib.mjs
index 76714b1..6fcb405 100644
--- a/packages/capture/scripts/capture-lib.mjs
+++ b/packages/capture/scripts/capture-lib.mjs
@@ -686,6 +686,12 @@ export async function installOriginGuard(context, { allowedOrigins, onBlocked, d
  */
 const isErrorPage = (url) => hasScheme(url, 'chrome-error') || url === 'about:blank';
 
+/** A page obtained without calling newPage, so the lint has no call to match. */
+export async function firstOpenPage(context) {
+  const [page] = context.pages();
+  return page;
+}
+
 export function installEscapeGuards(page, { onBlocked }) {
   page.on('popup', async (popup) => {
     const raw = popup.url();
