sabotage/fov-runtime-built-comparison.patch
diff --git a/packages/shared/src/identifiers.ts b/packages/shared/src/identifiers.ts
index ff6dc52..f72c394 100644
--- a/packages/shared/src/identifiers.ts
+++ b/packages/shared/src/identifiers.ts
@@ -226,6 +226,11 @@ export function assetKind(contentType: string): AssetKind {
  * artifact; failing is what we do everywhere else. Deciding by kind rather than
  * by sniffing the bytes keeps the choice visible in the index.
  */
+/** An identifier test compiled at runtime — no source-level comparison to match. */
+export function matchesBuiltPrefix(path: string, prefix: string): boolean {
+  return new RegExp(`^${prefix}`).test(path);
+}
+
 export function isTextualAsset(contentType: string): boolean {
   const mime = parseMime(contentType);
   if (mime === null) return false;
