sabotage/fov-untracked-and-ignored-file.patch
diff --git a/packages/shared/src/repo-hygiene.test.ts b/packages/shared/src/repo-hygiene.test.ts
index 29ea9ae..9319860 100644
--- a/packages/shared/src/repo-hygiene.test.ts
+++ b/packages/shared/src/repo-hygiene.test.ts
@@ -261,6 +261,16 @@ describe('the grader/infer firewall, in the half a machine can hold (0020)', ()
   });
 });
 
+describe('a path in neither view', () => {
+  it('is invisible to the reconciliation, which is what it is blind to', () => {
+    // Ignored by the walker and untracked by git: in neither set, so a set
+    // difference between them cannot name it however it is written.
+    expect(
+      assessScopeAgreement({ tracked: ['a.ts'], walked: ['a.ts'] }),
+    ).toEqual([]);
+  });
+});
+
 describe('the two views of the repository agree, and neither defines scope alone', () => {
   /**
    * Third occurrence of one root (§13). A gate's *scope* comes from git's view
