sabotage/gap-count-not-recomputed.patch
diff --git a/packages/schema/src/capture-model.ts b/packages/schema/src/capture-model.ts
index 23e127c..5eb699d 100644
--- a/packages/schema/src/capture-model.ts
+++ b/packages/schema/src/capture-model.ts
@@ -381,16 +381,6 @@ export const CaptureModelSchema = z
        * runtime too, but a schema that accepts an incoherent model is a schema
        * that will be handed one.
        */
-      if (model.manifest.counts.gaps !== model.stageReport.gaps.length) {
-        ctx.addIssue({
-          code: 'custom',
-          path: ['manifest', 'counts', 'gaps'],
-          message:
-            `manifest counts ${model.manifest.counts.gaps} gap(s) but the stage report carries ` +
-            `${model.stageReport.gaps.length}. One run, one number — a gap added after the ` +
-            'manifest was built is a gap the manifest does not know about.',
-        });
-      }
       const defined = new Set(model.stageReport.gaps.map((g) => g.gapId));
       for (const [gapId, where] of referencedGaps) {
         if (!defined.has(gapId)) {
