sabotage/grade-empty-truth-scores.patch
diff --git a/packages/verify/src/grade/grade.ts b/packages/verify/src/grade/grade.ts
index 5f448a9..d1b5ff6 100644
--- a/packages/verify/src/grade/grade.ts
+++ b/packages/verify/src/grade/grade.ts
@@ -577,15 +577,9 @@ export function gradeSiteModel(input: GradeInput): GradeReport {
    * the second, and it reports a bug in the first — the same arrangement as the
    * post-click origin check behind the router chokepoint.
    */
-  const emptyTruth =
-    all.truthInUniverse === 0
-      ? `the ground truth has no endpoints under ${truth.basePath}; §6 — a grader whose truth did not load reports nothing`
-      : undefined;
-
   const metrics: MetricResult[] = GRADE_METRICS.map((metric) => {
     const tally = byMetric[metric.id] ?? ZERO;
     const ungrounded =
-      emptyTruth ??
       notDerivedByMetric.get(metric.id) ??
       notDerivedByCategory.get(metric.category) ??
       tally.ungrounded;
