sabotage/idempotence-accepts-one-run.patch
diff --git a/packages/shared/src/capture-idempotence.ts b/packages/shared/src/capture-idempotence.ts
index 718feff..b9b1e7b 100644
--- a/packages/shared/src/capture-idempotence.ts
+++ b/packages/shared/src/capture-idempotence.ts
@@ -90,7 +90,7 @@ export function assessCaptureIdempotence(input: {
   // a clean report, because "no runs differed" over a single run is the
   // permissive answer and reads exactly like success (§13's empty-container
   // family — this is the `.every([])` shape with a directory in place of a list).
-  if (input.runs.length < 2) {
+  if (input.runs.length < 1) {
     throw new Error(
       `idempotence needs at least two runs to compare and got ${input.runs.length}. ` +
       'A single crawl cannot disagree with itself, and reporting it as stable is the ' +
