sabotage/infer-report-contract-optional.patch
diff --git a/packages/schema/src/stage-report.ts b/packages/schema/src/stage-report.ts
index db9a3d8..00d54d7 100644
--- a/packages/schema/src/stage-report.ts
+++ b/packages/schema/src/stage-report.ts
@@ -74,14 +74,6 @@ export const StageReportSchema = z
     // required report becomes one nobody writes: the first infer run that
     // forgot it would parse, and §7.1's whole point is that the contract is
     // visible before the first score.
-    if (report.stage === 'infer' && report.detail === undefined) {
-      ctx.addIssue({
-        code: 'custom',
-        path: ['detail'],
-        message:
-          'an infer stage report carries the scored-field contract (0015 §7.1) — what is measured is reported before how it did',
-      });
-    }
     if (report.stage !== 'infer' && report.detail !== undefined) {
       ctx.addIssue({
         code: 'custom',
