sabotage/landmark-defers-to-href.patch
diff --git a/packages/infer/src/binding.ts b/packages/infer/src/binding.ts
index c4b39f7..002b0cb 100644
--- a/packages/infer/src/binding.ts
+++ b/packages/infer/src/binding.ts
@@ -110,6 +110,7 @@ export function urlBindingRungs(base: string): ReadonlyArray<BindingRung<Bindabl
       id: 'not-a-control',
       run: (c) => {
         if (c.tag === null || !LANDMARK_TAGS.has(c.tag)) return null;
+        if (c.attributes['href'] !== undefined) return null;
         return {
           kind: 'decline',
           reason: 'landmark',
