sabotage/manifest-field-added-unclassified.patch
diff --git a/packages/schema/src/manifest.ts b/packages/schema/src/manifest.ts
index abbf3e5..dcb7e4b 100644
--- a/packages/schema/src/manifest.ts
+++ b/packages/schema/src/manifest.ts
@@ -155,6 +155,8 @@ export const CaptureManifestSchema = z.strictObject({
   }),
 
   /** Index of what this capture contains. */
+  /** Wall-clock seconds the crawl spent waiting on the network. */
+  networkWaitSeconds: z.number().nonnegative().optional(),
   patterns: z.array(RoutePatternSummarySchema),
   routeIds: z.array(RouteIdSchema),
   flowIds: z.array(FlowIdSchema),
