sabotage/merge-container-ambiguity-ignored.patch
diff --git a/packages/infer/src/entities.ts b/packages/infer/src/entities.ts
index 176e033..96fb32d 100644
--- a/packages/infer/src/entities.ts
+++ b/packages/infer/src/entities.ts
@@ -228,7 +228,7 @@ function mergeContainedRows(rows: readonly RowShape[]): RowShape[] {
     // Ambiguous in either direction is a merge that does not happen. Zero
     // containers is the ordinary case; two or more is the coincidence the
     // uniqueness condition exists to reject.
-    if (containers.length !== 1) continue;
+    if (containers.length === 0) continue;
     const into = containers[0]!;
     absorbed.add(row);
     absorbedBy.set(into, [...(absorbedBy.get(into) ?? []), row]);
