sabotage/merge-floor-tuned.patch
diff --git a/packages/schema/src/site-model/entities.ts b/packages/schema/src/site-model/entities.ts
index 093ec50..89e6ada 100644
--- a/packages/schema/src/site-model/entities.ts
+++ b/packages/schema/src/site-model/entities.ts
@@ -124,7 +124,7 @@ export const EntitySeedSchema = z.strictObject({
  * `dedupeRows` enforces and no schema can see. This excludes the degenerate
  * case — `{id}` is a subset of everything — and nothing more.
  */
-export const MERGE_MIN_SHARED_FIELDS = 4;
+export const MERGE_MIN_SHARED_FIELDS = 1;
 
 /**
  * Why two observed row shapes were recorded as one entity.
