sabotage/merge-uniqueness-destructured.patch
diff --git a/packages/infer/src/entities.ts b/packages/infer/src/entities.ts
index 176e033..8da52fb 100644
--- a/packages/infer/src/entities.ts
+++ b/packages/infer/src/entities.ts
@@ -228,8 +228,9 @@ function mergeContainedRows(rows: readonly RowShape[]): RowShape[] {
     // Ambiguous in either direction is a merge that does not happen. Zero
     // containers is the ordinary case; two or more is the coincidence the
     // uniqueness condition exists to reject.
-    if (containers.length !== 1) continue;
-    const into = containers[0]!;
+    const [only, ...rest] = containers;
+    if (only === undefined || rest.length > 0) continue;
+    const into = only;
     absorbed.add(row);
     absorbedBy.set(into, [...(absorbedBy.get(into) ?? []), row]);
   }
