sabotage/notderived-scoped-to-category.patch
diff --git a/packages/verify/src/grade/grade.ts b/packages/verify/src/grade/grade.ts
index 5f448a9..f9bcb89 100644
--- a/packages/verify/src/grade/grade.ts
+++ b/packages/verify/src/grade/grade.ts
@@ -494,7 +494,7 @@ export function gradeSiteModel(input: GradeInput): GradeReport {
    * A per-category-only list cannot say either thing.
    */
   const notDerivedByCategory = new Map(
-    truth.notDerived.filter((n) => n.metric === undefined).map((n) => [n.category, n.reason]),
+    truth.notDerived.map((n) => [n.category, n.reason]),
   );
   const notDerivedByMetric = new Map(
     truth.notDerived
