sabotage/probe-detector-substring.patch
diff --git a/packages/capture/scripts/rung3.mjs b/packages/capture/scripts/rung3.mjs
index fd7af33..9402e72 100644
--- a/packages/capture/scripts/rung3.mjs
+++ b/packages/capture/scripts/rung3.mjs
@@ -400,7 +400,7 @@ async function runProbe({ ctx, routeId, record, candidate, flowId, label, cssomC
       const newClasses = before.classes === after.classes ? [] :
         [...new Set(after.classes.split('|').join(' ').split(/\s+/).filter(Boolean))]
           .filter((c) => !beforeClasses.has(c));
-      const unexplainedClasses = newClasses.filter((c) => !cssomClasses.has(c));
+      const unexplainedClasses = newClasses.filter((c) => !cssomClasses.includes(c));
 
       const attributeChanges = [];
       const width = Math.min(before.inlineStyles.length, after.inlineStyles.length);
@@ -529,7 +529,7 @@ if (authRoute) {
 
   // Which classes/attributes any extracted CSSOM rule already explains. §6 uses
   // probing only for the changes CSS cannot express, so this decides what needs one.
-  const cssomClasses = selectorClassNames(record.captured.stateRules.map((r) => r.selector));
+  const cssomClasses = record.captured.stateRules.map((r) => r.selector).join(' ');
 
   const probeCtx = await guardContext(await browser.newContext({
     viewport: { width: VIEWPORT.width, height: VIEWPORT.height },
