sabotage/select-extraction-requires-a-name.patch
diff --git a/packages/capture/scripts/capture-lib.mjs b/packages/capture/scripts/capture-lib.mjs
index 76714b1..e652ce9 100644
--- a/packages/capture/scripts/capture-lib.mjs
+++ b/packages/capture/scripts/capture-lib.mjs
@@ -481,7 +481,7 @@ export const EXTRACT = (properties) => {
    * nodes in `dom.json` for equality. An extractor that silently declines is
    * indistinguishable from one that never looked, which is the bug being fixed.
    */
-  for (const select of document.querySelectorAll('select')) {
+  for (const select of document.querySelectorAll('select[name], select[id]')) {
     const values = [...select.options].map((o) => o.value).filter((v) => v !== '');
     constraints.push({
       control: 'select',
