sabotage/selector-substring-match.patch
diff --git a/packages/capture/scripts/capture-lib.mjs b/packages/capture/scripts/capture-lib.mjs
index e06cfe6..55ef2d0 100644
--- a/packages/capture/scripts/capture-lib.mjs
+++ b/packages/capture/scripts/capture-lib.mjs
@@ -54,17 +54,7 @@ const STATE_PSEUDOS = new Set(S.STATE_PSEUDO_CLASSES);
 export function selectorClassNames(selectorTexts) {
   const names = new Set();
   for (const text of selectorTexts) {
-    try {
-      selectorParser((sel) => {
-        sel.walkClasses((node) => names.add(node.value));
-      }).processSync(text, { lossless: false });
-    } catch {
-      // operational: postcss throws on selectors real stylesheets contain.
-      // A selector that will not parse contributes no class names, which makes
-      // a class look *unexplained* rather than explained — the safe direction:
-      // an extra probed state is noise, a missed one is a silent drop.
-      continue;
-    }
+    for (const token of text.match(/[a-zA-Z]\w*/g) ?? []) names.add(token);
   }
   return names;
 }
