sabotage/surface-measured-logged-out.patch
diff --git a/packages/verify/fixtures/vikunja/browser-surface.json b/packages/verify/fixtures/vikunja/browser-surface.json
index 5d4b6e2..d7a4088 100644
--- a/packages/verify/fixtures/vikunja/browser-surface.json
+++ b/packages/verify/fixtures/vikunja/browser-surface.json
@@ -17,43 +17,14 @@
   "declaredOperations": 143,
   "xhr": [
     "GET /",
-    "GET /api/v1/avatar/sfadmin",
     "GET /api/v1/info",
-    "GET /api/v1/labels",
-    "GET /api/v1/notifications",
-    "GET /api/v1/projects",
-    "GET /api/v1/projects/1",
-    "GET /api/v1/projects/1/views/1/tasks",
-    "GET /api/v1/projects/2",
-    "GET /api/v1/projects/2/views/5/tasks",
-    "GET /api/v1/tasks/1",
-    "GET /api/v1/tasks/1/comments",
-    "GET /api/v1/tasks/all",
-    "GET /api/v1/teams",
-    "GET /api/v1/user",
-    "GET /api/v1/user/timezones",
-    "POST /api/v1/login",
-    "POST /api/v1/user/settings/general"
+    "POST /api/v1/login"
   ],
   "formActions": [],
   "staticAssetRequests": 236,
   "describedByDocument": [
     "GET /api/v1/info",
-    "GET /api/v1/labels",
-    "GET /api/v1/notifications",
-    "GET /api/v1/projects",
-    "GET /api/v1/projects/1",
-    "GET /api/v1/projects/1/views/1/tasks",
-    "GET /api/v1/projects/2",
-    "GET /api/v1/projects/2/views/5/tasks",
-    "GET /api/v1/tasks/1",
-    "GET /api/v1/tasks/1/comments",
-    "GET /api/v1/tasks/all",
-    "GET /api/v1/teams",
-    "GET /api/v1/user",
-    "GET /api/v1/user/timezones",
-    "POST /api/v1/login",
-    "POST /api/v1/user/settings/general"
+    "POST /api/v1/login"
   ],
   "verdict": "overlapping"
 }
