sabotage/truth-allof-alias-unfollowed.patch
diff --git a/packages/verify/src/grade/truth/swagger2.ts b/packages/verify/src/grade/truth/swagger2.ts
index 1c3f38d..425a7f4 100644
--- a/packages/verify/src/grade/truth/swagger2.ts
+++ b/packages/verify/src/grade/truth/swagger2.ts
@@ -244,7 +244,7 @@ const deref = (spec: Json, node: Json, seen: ReadonlySet<string>): { node: Json;
     // A bare `$ref` first: where both spellings are present the direct one is
     // the node's own claim, and `allOf` beside it would be the composition case
     // that throws anyway.
-    const ref = typeof current['$ref'] === 'string' ? current['$ref'] : soleAllOfRef(current);
+    const ref = typeof current['$ref'] === 'string' ? current['$ref'] : null;
     if (ref === null) break;
     // A cycle is not an error in a schema — Gitea's `Repository.parent` is a
     // Repository. It is a place to stop, and stopping silently at a fixed depth
