sabotage/walker-mustreach-disabled.patch
diff --git a/packages/shared/src/scan-walker.ts b/packages/shared/src/scan-walker.ts
index 8904e81..43c5a06 100644
--- a/packages/shared/src/scan-walker.ts
+++ b/packages/shared/src/scan-walker.ts
@@ -135,14 +135,6 @@ export function assessScanCoverage(
       `walked ${relativePaths.length} file(s) under ${describe.root}, expected at least ${expect.minFiles}. A scan that matches nothing reports success.`,
     );
   }
-  for (const prefix of expect.mustReach) {
-    const under = parsePathPattern(`/${prefix}/**`);
-    if (!relativePaths.some((r) => matchPath(r, under))) {
-      shortfalls.push(
-        `the walk never reached ${prefix}/ — it is either missing, ignored, or filtered out by the ${describe.profile} profile.`,
-      );
-    }
-  }
   return shortfalls;
 }
 
